author
"Bette Dam"
date
"March 10 2019"
description
"One of the most elusive figures in the US War on Terror, the Taliban’s former supreme leader Mullah Omar evaded NATO capture for 12 years taking refuge in a safe house just two miles from a major US forward operating base. Bette Dam reveals the details of how this major intelligence failure unfolded."
id
"44LJGzQizLY4CZZG8qwE"
image
"https://firebasestorage.googleapis.com/v0/b/zomia-client.appspot.com/o/images%2FThe%20Secret%20Life%20of%20Mullah%20Omar.pdf?alt=media&token=5e96e85a-b1ea-49a9-8c23-73ff1694d9d8"
pdf
"https://firebasestorage.googleapis.com/v0/b/zomia-client.appspot.com/o/reports%2FThe%20Secret%20Life%20of%20Mullah%20Omar.pdf?alt=media&token=41c3f644-e442-4476-8449-f3ea81305452"
text
"Very little is known about Mullah Omar, the notorious supreme leader of the Taliban. Only a handful of photographs are believed to exist, and his biographical details have long been contested. Upon the fall of the Taliban government in 2001, he effectively vanished, becoming, after Osama bin Laden, one of the most wanted men in the world. In this exclusive, Bette Dam exposes the secret history of a Mullah Omar from that disappearance until his death — covered up by the Taliban — in 2013. For five years, with remarkable courage and tenacity, Dam traveled to insurgent-controlled Afghanistan, meeting with Omar's close associates, friends and relatives and interviewing dozens of Taliban leaders. \nShe also interviewed dozens of Afghan and U.S. officials — who began to tell a very different story in private than they had in public. In December 2018, Dam gained unprecedented access to Mullah Omar's bodyguard — who, for twelve years, lived with the Taliban leader, and was one of his only conduits to the outside world. Dam is the first journalist to interview him. The story that emerges is astonishing, contradicting over a decade of analysis by the U.S. intelligence community, and almost everyone else. After 2001, Mullah Omar did indeed vanish — but he vanished to a safe house just two miles from a major U.S. Forward Operating Base, housing thousands of soldiers. Dam's seminal work not only sets the history straight — it suggests a staggering U.S. intelligence failure."
title
"The Secret Life of Mullah Omar"
